app/views/gossips/show.html.erb

      <% if current_user %>
        <% if current_user && current_user.likes.exists?(gossip_id: @gossip.id) %>
---
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."gossip_id" = $2 LIMIT $3  [["user_id", 11], ["gossip_id", 15], ["LIMIT", 1]]

    <ul class="list-group list-group-flush">
      <li class="list-group-item"><strong>Auteur:</strong> <%= link_to @gossip.user.first_name, user_path(@gossip.user) %></li>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      <li class="list-group-item"><strong>Date de création:</strong> <%= @gossip.created_at %></li>
      <li class="list-group-item"><strong>Nombre de likes: </strong><%= @gossip.likes.count %></li>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 15]]


<% @gossip.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 15]]