app/controllers/likes_controller.rb

    def like
      @like = current_user.likes.build(gossip_id: params[:gossip_id])
      if @like.save
---
INSERT INTO "likes" ("user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 11], ["gossip_id", 15], ["created_at", "2024-05-02 13:19:07.969925"], ["updated_at", "2024-05-02 13:19:07.969925"]]

    def unlike
      @like = current_user.likes.find_by(gossip_id: params[:gossip_id])
      if @like
        @like.destroy
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."gossip_id" = $2 LIMIT $3  [["user_id", 11], ["gossip_id", 15], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]